# Pandas Operations

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'col1':[1,2,3,4],
                  'col2':[444,555,666,444],
                  'col3':['abc','def','ghi','xyz']})

In [3]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [5]:
#Finding unique values in a data frame

#Using the uniques() function

df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [8]:
#To get total no of unique values in a df,

#We use the nunique() function

df['col2'].nunique()

3

In [10]:
#Conditional Selection

df[df['col1']>2]

#The above returns all the columns which has the value greter than 2 in the form of a df

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

Applying function to the column

In [11]:
#Define a function

def times2(x):
    return x*2

In [13]:
#Here we have defined a function above and now we will broad cast that function to the column in the df
#here we are assigning it to 'col1' from the df

df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

Apply function is more powerful when we use it with lambda expressions

In that way we do not have to worry about defining a function and then calling it inside the apply()

In [16]:
#Example below

df['col2'].apply(lambda x: x*2)

#This is one of the powerful feature of pandas applying lambda expressions

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

Soting and ordering a Data Frame

In [17]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [19]:
df.sort_values('col2')

#Note how the index stays attached to the rows

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi